app/controllers/tasks_controller.rb

  def create
    @task = Task.new(params[:task])

    if @task.save
---
INSERT INTO "tasks" ("created_at", "description", "owner_id", "performer_id", "state", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @task = Task.find(params[:id])

    if @task.update_attributes(params[:task])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "tasks" SET "state" = 'aaaaa', "title" = 'bbbbb', "description" = 'ccccccccc', "updated_at" = '2013-05-23 22:36:01.499905' WHERE "tasks"."id" = 1