app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    if @user.save
---
INSERT INTO "users" ("created_at", "email", "password_digest", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 17 May 2013 07:13:16 UTC +00:00], ["email", "wef"], ["password_digest", "wewet"], ["updated_at", Fri, 17 May 2013 07:13:16 UTC +00:00]]

  def update
    @user = User.find(params[:id])
    p @user
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "users" SET "password_digest" = '$2a$10$Udq1bFuWv4.RGF2NWv6h5uBI4AvaFzWiHpRSxPr.stuzX9qwF6qgG', "updated_at" = '2013-05-20 11:01:49.600467' WHERE "users"."id" = 3